[["Nike Is Improving Its Sustainability Plans With Its “Move To ...", "https://www.vogue.co.uk/news/article/nike-move-to-zero-sustainability", "Sep 30, 2020 — Then came the eco swimwear collections, and pledges to use only renewable energy and reduce its shipping emissions. Now, Nike has gone one ..."], ["Nike's most sustainable performance trainers ever are here", "https://www.gq-magazine.co.uk/fashion/article/nike-alpha-fly-next-nature-2021", "Sep 17, 2021 — In turn, Nike has so far released some of its most eco-friendly sneaker designs in the brand's history, such as the Space Hippie and its “ ..."], ["More content - Facebook", "https://m.facebook.com/157977229149401", "Eco Green Friendly Products. Nike Women's WMNS Air Max Motion 2 Gymnastics Shoes [gallery] Product Description Scarpa pr."], ["Sustainable Design Lessons from Nike's Product ...", "https://www.design2market.co.uk/sustainable-design-lessons-from-nike/", "Circular Design is all about considering the full environmental impact of the new concept during the product development. Nike recently published details of ..."], ["Nike Quietly Goes Green - Bloomberg.com", "https://www.bloomberg.com/news/articles/2009-06-11/nike-quietly-goes-green", "Jun 11, 2009 — The company launched its first line of environmentally friendly shoes, called \"Considered,\" in 2005. It had high hopes for a walking boot, made ..."], ["Swoosh and Sustainability: Nike's Emergence as a Global ...", "https://sustainablebrands.com/read/supply-chain/swoosh-and-sustainability-nike-s-emergence-as-a-global-sustainable-brand", "May 17, 2013 — Environmental sustainability principles frame Nike's business model and its determination to limit the use of natural resources. In fact for ..."], ["The New Nike Running Shoes Are the Brand's Most ...", "https://www.self.com/story/nike-air-zoom-alphafly-next-nature-release", "Sep 13, 2021 — The New Nike Running Shoes Are the Brand's Most Sustainable Yet ... They're made with 50% recycled material. ... Many athletic-wear companies have ..."], ["Air Zoom Alphafly Next Nature is Nike's most sustainably ...", "https://viable.earth/sustainable-fashion/air-zoom-alphafly-next-nature-is-nikes-most-sustainably-minded-performance-shoe/", "Sep 14, 2021 — Nike has debuted another sustainable runner called Nike Air Zoom Alphafly Next Nature, which is said to be its most eco-friendly performance ..."], ["UCLA staff's book explores intersection of sustainability ...", "https://dailybruin.com/2018/07/29/ucla-staffs-book-explores-intersection-of-sustainability-marketing", "Jul 29, 2018 — Nike's “Considered,” a line of shoes made of cannabis, was released in 2005. Though the company expected the eco-friendly hemp design to ..."], ["Eco-Friendly Shoes: How They Are Helping The Environment", "https://betterworldapparel.com/footwear/eco-friendly-shoes-help-environment/", "Nov 30, 2018 — It might surprise you to find out that as much as 75% of all Nike products contain some recycled material. Nike Grind and Nike Air are also ..."]]